namespace c샵과제1 {

   /* 
1. 자동차에 대한 클래스를 작성하기
문제1) 속성(멤버 변수) - 대리점명은 상수 클래스변수로 선언하시오(10점)
대리점명 = 동대구 영업소"
문제2) 제조사, 색상, 가격, 모델명은 인스턴스 속성으로 선언하시오. (10점)
문제3) 기본 생성자를 만들고 아래의 속성값들을 초기화 하시오. (10점)
제조사-"기아", 색상 -"블랙', 모델명 -"K7"
가격 -"4천만원"
문제4) 모든 속성들을 매개변수로 전달하여 객체를 생성할수있는 생성자 추가하시오(10점)
문제5) 모든 속성 정보들을 출력하는 인스턴스 메쏘드를 추가하시오. (10점)
 
2.Main) 에서 자동차 클래스 객체를 생성하여 활용하기
문제1) 기본생성자를 사용하여 객체를 생성하고 모든 속성 정보 출력하시오 (10점)
문제2) 기본 생성자 객체에서 모델명을 설정하는 인스턴스 메쏘드를 사용하여 "K9" 으로 변경하시오. (10점)
문제3) 기본 생성자 객체에서 가격을 설정하는 인스턴스 메쏘드를 사용하여 " 6천만원" 으로 변경하시오. (10점)
문제4) 기본 생성자 객체에서 변경된 모델과 가격을 출력하시오. (10점)
문제5) 매개변수가 있는 생성자를 사용하여 객체 생성하고 모든 속성 정보를 출력하시오 (10점)
(2번 문제 해결에 있어 추가로 필요한 메소드는 개인적으로 별도로 구현하여 사용하시면 되겠습니다.)
(25번과 같은 경우에는, 자유롭게 속성값을 부여하여 객체를 생성한 뒤 출력하면 되겠습니다.)
*/

  
}